<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link href="https://fonts.googleapis.com/css?family=Exo+2" rel="stylesheet">
    <link rel="stylesheet" href="style.css">
    <title>ДЗ по уроку 3</title>
  </head>
  <body>
    <header>
      <h1>Курс PHP1. ДЗ по уроку 3</h1>
    </header>
    <div class="main">
      <div class="task">
        <p>Задание № 1</p>
        <?php
          $a = 0;
          while ($a <= 100) {
            if ($a % 3 == 0) echo "$a<br>";
            $a++;
          }
         ?>
      </div>
      <div class="task">
        <p>Задание № 2</p>
        <?php
          $a = 0;
          do {
            if ($a % 2 == 0) echo "$a - четное число<br>";
            else echo "$a - нечетное число<br>";
            $a++;
          } while ($a <= 10);
         ?>
      </div>
      <div class="task">
        <p>Задание № 3</p>
        <?php
          $arr = ["Московская область" => ["Москва", "Зеленоград", "Клин"],
                  "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
                  "Татарстан" => ["Казань", "Набережные челны", "Альметьевск", "Нижнекамск"]];
          print_r($arr).'<br>';
         ?>
      </div>
      <div class="task">
        <p>Задание № 4</p>
        <?php
          $transliter = ["а" => "a",
                         "б" => "b",
                         "г" => "g",
                         "д" => "d",
                         "е" => "e",
                         "ё" => "yo",
                         "ж" => "zh",
                         "з" => "z",
                         "и" => "i",
                         "й" => "j",
                         "к" => "k",
                         "л" => "l",
                         "м" => "m",
                         "н" => "n",
                         "о" => "o",
                         "п" => "p",
                         "р" => "r",
                         "с" => "s",
                         "т" => "t",
                         "у" => "u",
                         "ф" => "f",
                         "х" => "h",
                         "ц" => "c",
                         "ч" => "ch",
                         "ш" => "sh",
                         "щ" => "shch",
                         "ъ" => "``",
                         "ы" => "y",
                         "ь" => "`",
                         "э" => "eh",
                         "ю" => "yu",
                         "я" => "ya"];
$text = 'Но чтобы вы поняли, откуда возникает это превратное представление людей, порицающих
наслаждение и восхваляющих страдания, я раскрою перед вами всю картину и разъясню, что именно
говорил этот человек, открывший истину, которого я бы назвал зодчим счастливой жизни. Действительно,
никто не отвергает, не презирает, не избегает наслаждений только из-за того, что это наслаждения,
но лишь из-за того, что тех, кто не умеет разумно предаваться наслаждениям, постигают великие
страдания. Равно как нет никого, кто возлюбил бы, предпочел и возжаждал бы само страдание только
за то, что это страдание, а не потому, что иной раз возникают такие обстоятельства, когда страдания
и боль приносят некое и немалое наслаждение. Если воспользоваться простейшим примером, то кто из нас
стал бы заниматься какими бы то ни было тягостными физическими упражнениями, если бы это не приносило
с собой некоей пользы? И кто мог бы по справедливости упрекнуть стремящегося к наслаждению, которое
не несло бы с собой никаких неприятностей, или того, кто избегал бы такого страдания, которое
не приносило бы с собой никакого наслаждения?';
          function translitRus2Lat($transliter, $text)
          {
            foreach ($transliter as $key => $value) {
              $rus[] = $key;
              $lat[] = $value;
            }
            return str_replace($rus, $lat, $text);
          }
          echo translitRus2Lat($transliter, $text);
         ?>
      </div>
      <div class="task">
        <p>Задание № 5</p>
        <?php
          $text = 'Но чтобы вы поняли откуда возникает это превратное представление людей';
          echo str_replace(' ', '_', $text);
         ?>
      </div>
      <div class="task">
        <p>Задание № 6</p>
        <ul>
          <li><a href="#">Пункт 1</a></li>
          <li><a href="#">Пункт 2</a></li>
          <li><a href="#">Пункт 3</a></li>
        </ul><br><br>
        <p>Меню на PHP</p>
          <?php
          $menuItems = ['Пункт 1', 'Пункт 2', 'Пункт 3'];
          echo "<ul>";
          foreach ($menuItems as $key => $value) {
            echo "<li><a href='#'>$value</a></li>";
          }
         ?>
      </div>
      <div class="task">
        <p>Задание № 7</p>
        <?php
        for ($i=0; $i < 10; $i++) echo "$i<br>";
         ?>
      </div>
      <div class="task">
        <p>Задание № 8</p>
        <?php
          $arr = ["Московская область" => ["Москва", "Зеленоград", "Клин"],
                  "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
                  "Татарстан" => ["Казань", "Набережные челны", "Альметьевск", "Нижнекамск"]];
                  foreach ($arr as $key => $value) $str1[] = $value;
                  for ($i=0; $i < count($str1); $i++) {
                    for ($j=0; $j < count($str1[$i]) ; $j++) {
                        if (preg_match("/^К/", $str1[$i][$j]) == 1) {
                          print_r($str1[$i][$j]);
                          echo "<br>";
                        }
                    }
                    // print_r($str1[$i]);
                    // echo "<br>";
                  }
                  // for ($i=0; $i < count($str1); $i++) {
                  //   if (preg_match("/^К/", $str1[$i]) == 1) echo "$str1[$i]<br>";
                  // }
                  // print_r($str2);
         ?>
      </div>
      <div class="task">
        <p>Задание № 9</p>
        <?php
        echo "Можно было и не писать функцию заново и не создавать массив.<br><br>";
        $transliter = ["а" => "a",
                       "б" => "b",
                       "г" => "g",
                       "д" => "d",
                       "е" => "e",
                       "ё" => "yo",
                       "ж" => "zh",
                       "з" => "z",
                       "и" => "i",
                       "й" => "j",
                       "к" => "k",
                       "л" => "l",
                       "м" => "m",
                       "н" => "n",
                       "о" => "o",
                       "п" => "p",
                       "р" => "r",
                       "с" => "s",
                       "т" => "t",
                       "у" => "u",
                       "ф" => "f",
                       "х" => "h",
                       "ц" => "c",
                       "ч" => "ch",
                       "ш" => "sh",
                       "щ" => "shch",
                       "ъ" => "``",
                       "ы" => "y",
                       "ь" => "`",
                       "э" => "eh",
                       "ю" => "yu",
                       "я" => "ya"];
$text = 'Но чтобы вы поняли';
        function translitRus2Lat1($transliter, $text)
        {
          foreach ($transliter as $key => $value) {
            $rus[] = $key;
            $lat[] = $value;
          }
          return str_replace($rus, $lat, $text);
        }
        $text = translitRus2Lat1($transliter, $text);
        echo str_replace(' ', '_', $text);
         ?>
      </div>
    </div>
  </body>
</html>
